app/controllers/home_controller.rb

SELECT "details".* FROM "details" WHERE "details"."user_id" = $1  [["user_id", 2]]
---
  def index
  	if user_signed_in? then
  	 	if !Dir.exists?(Rails.root.join(current_user.email)) then

  			Dir.mkdir(Rails.root.join(current_user.email))

  		end
  	end

  	@dat=current_user.details.all

INSERT INTO "details" ("email", "filename", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "q@q.com"], ["filename", "JaganCV.pdf"], ["user_id", 2], ["created_at", "2015-08-09 16:09:24.407718"], ["updated_at", "2015-08-09 16:09:24.407718"]]
---
  def upload
 uploaded_io = params[:file]

  File.open(Rails.root.join(current_user.email, uploaded_io.original_filename), 'wb') do |file|
    file.write(uploaded_io.read)
  end
 det= Detail.new
	  det.email=current_user.email
	  det.filename=uploaded_io.original_filename

	  current_user.details << det